GopalSaraf/Practicals/PSDL/include/proc/pic18f56q43.h
// Register: U5UIR
#define U5UIR U5UIR
extern volatile unsigned char           U5UIR               __at(0x2FD);
#ifndef _LIB_BUILD
asm("U5UIR equ 02FDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U5ABDIE                :1;
        unsigned                        :3;
        unsigned U5ABDIF                :1;
        unsigned U5WUIF                 :1;
    };
} U5UIRbits_t;
extern volatile U5UIRbits_t U5UIRbits __at(0x2FD);
// bitfield macros
#define _U5UIR_ABDIE_POSN                                   0x2
#define _U5UIR_ABDIE_POSITION                               0x2
#define _U5UIR_ABDIE_SIZE                                   0x1
#define _U5UIR_ABDIE_LENGTH                                 0x1
#define _U5UIR_ABDIE_MASK                                   0x4
#define _U5UIR_ABDIF_POSN                                   0x6
#define _U5UIR_ABDIF_POSITION                               0x6
#define _U5UIR_ABDIF_SIZE                                   0x1
#define _U5UIR_ABDIF_LENGTH                                 0x1
#define _U5UIR_ABDIF_MASK                                   0x40
#define _U5UIR_WUIF_POSN                                    0x7
#define _U5UIR_WUIF_POSITION                                0x7
#define _U5UIR_WUIF_SIZE                                    0x1
#define _U5UIR_WUIF_LENGTH                                  0x1
#define _U5UIR_WUIF_MASK                                    0x80
#define _U5UIR_U5ABDIE_POSN                                 0x2
#define _U5UIR_U5ABDIE_POSITION                             0x2
#define _U5UIR_U5ABDIE_SIZE                                 0x1
#define _U5UIR_U5ABDIE_LENGTH                               0x1
#define _U5UIR_U5ABDIE_MASK                                 0x4
#define _U5UIR_U5ABDIF_POSN                                 0x6
#define _U5UIR_U5ABDIF_POSITION                             0x6
#define _U5UIR_U5ABDIF_SIZE                                 0x1
#define _U5UIR_U5ABDIF_LENGTH                               0x1
#define _U5UIR_U5ABDIF_MASK                                 0x40
#define _U5UIR_U5WUIF_POSN                                  0x7
#define _U5UIR_U5WUIF_POSITION                              0x7
#define _U5UIR_U5WUIF_SIZE                                  0x1
#define _U5UIR_U5WUIF_LENGTH                                0x1
#define _U5UIR_U5WUIF_MASK                                  0x80

// Register: U5ERRIR
#define U5ERRIR U5ERRIR
extern volatile unsigned char           U5ERRIR             __at(0x2FE);
#ifndef _LIB_BUILD
asm("U5ERRIR equ 02FEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U5TXCIF                :1;
        unsigned U5RXFOIF               :1;
        unsigned U5RXBKIF               :1;
        unsigned U5FERIF                :1;
        unsigned U5CERIF                :1;
        unsigned U5ABDOVF               :1;
        unsigned U5PERIF                :1;
        unsigned U5TXMTIF               :1;
    };
} U5ERRIRbits_t;
extern volatile U5ERRIRbits_t U5ERRIRbits __at(0x2FE);
// bitfield macros
#define _U5ERRIR_TXCIF_POSN                                 0x0
#define _U5ERRIR_TXCIF_POSITION                             0x0
#define _U5ERRIR_TXCIF_SIZE                                 0x1
#define _U5ERRIR_TXCIF_LENGTH                               0x1
#define _U5ERRIR_TXCIF_MASK                                 0x1
#define _U5ERRIR_RXFOIF_POSN                                0x1
#define _U5ERRIR_RXFOIF_POSITION                            0x1
#define _U5ERRIR_RXFOIF_SIZE                                0x1
#define _U5ERRIR_RXFOIF_LENGTH                              0x1
#define _U5ERRIR_RXFOIF_MASK                                0x2
#define _U5ERRIR_RXBKIF_POSN                                0x2
#define _U5ERRIR_RXBKIF_POSITION                            0x2
#define _U5ERRIR_RXBKIF_SIZE                                0x1
#define _U5ERRIR_RXBKIF_LENGTH                              0x1
#define _U5ERRIR_RXBKIF_MASK                                0x4
#define _U5ERRIR_FERIF_POSN                                 0x3
#define _U5ERRIR_FERIF_POSITION                             0x3
#define _U5ERRIR_FERIF_SIZE                                 0x1
#define _U5ERRIR_FERIF_LENGTH                               0x1
#define _U5ERRIR_FERIF_MASK                                 0x8
#define _U5ERRIR_CERIF_POSN                                 0x4
#define _U5ERRIR_CERIF_POSITION                             0x4
#define _U5ERRIR_CERIF_SIZE                                 0x1
#define _U5ERRIR_CERIF_LENGTH                               0x1
#define _U5ERRIR_CERIF_MASK                                 0x10
#define _U5ERRIR_ABDOVF_POSN                                0x5
#define _U5ERRIR_ABDOVF_POSITION                            0x5
#define _U5ERRIR_ABDOVF_SIZE                                0x1
#define _U5ERRIR_ABDOVF_LENGTH                              0x1
#define _U5ERRIR_ABDOVF_MASK                                0x20
#define _U5ERRIR_PERIF_POSN                                 0x6
#define _U5ERRIR_PERIF_POSITION                             0x6
#define _U5ERRIR_PERIF_SIZE                                 0x1
#define _U5ERRIR_PERIF_LENGTH                               0x1
#define _U5ERRIR_PERIF_MASK                                 0x40
#define _U5ERRIR_TXMTIF_POSN                                0x7
#define _U5ERRIR_TXMTIF_POSITION                            0x7
#define _U5ERRIR_TXMTIF_SIZE                                0x1
#define _U5ERRIR_TXMTIF_LENGTH                              0x1
#define _U5ERRIR_TXMTIF_MASK                                0x80
#define _U5ERRIR_U5TXCIF_POSN                               0x0
#define _U5ERRIR_U5TXCIF_POSITION                           0x0
#define _U5ERRIR_U5TXCIF_SIZE                               0x1
#define _U5ERRIR_U5TXCIF_LENGTH                             0x1
#define _U5ERRIR_U5TXCIF_MASK                               0x1
#define _U5ERRIR_U5RXFOIF_POSN                              0x1
#define _U5ERRIR_U5RXFOIF_POSITION                          0x1
#define _U5ERRIR_U5RXFOIF_SIZE                              0x1
#define _U5ERRIR_U5RXFOIF_LENGTH                            0x1
#define _U5ERRIR_U5RXFOIF_MASK                              0x2
#define _U5ERRIR_U5RXBKIF_POSN                              0x2
#define _U5ERRIR_U5RXBKIF_POSITION                          0x2
#define _U5ERRIR_U5RXBKIF_SIZE                              0x1
#define _U5ERRIR_U5RXBKIF_LENGTH                            0x1
#define _U5ERRIR_U5RXBKIF_MASK                              0x4
#define _U5ERRIR_U5FERIF_POSN                               0x3
#define _U5ERRIR_U5FERIF_POSITION                           0x3
#define _U5ERRIR_U5FERIF_SIZE                               0x1
#define _U5ERRIR_U5FERIF_LENGTH                             0x1
#define _U5ERRIR_U5FERIF_MASK                               0x8
#define _U5ERRIR_U5CERIF_POSN                               0x4
#define _U5ERRIR_U5CERIF_POSITION                           0x4
#define _U5ERRIR_U5CERIF_SIZE                               0x1
#define _U5ERRIR_U5CERIF_LENGTH                             0x1
#define _U5ERRIR_U5CERIF_MASK                               0x10
#define _U5ERRIR_U5ABDOVF_POSN                              0x5
#define _U5ERRIR_U5ABDOVF_POSITION                          0x5
#define _U5ERRIR_U5ABDOVF_SIZE                              0x1
#define _U5ERRIR_U5ABDOVF_LENGTH                            0x1
#define _U5ERRIR_U5ABDOVF_MASK                              0x20
#define _U5ERRIR_U5PERIF_POSN                               0x6
#define _U5ERRIR_U5PERIF_POSITION                           0x6
#define _U5ERRIR_U5PERIF_SIZE                               0x1
#define _U5ERRIR_U5PERIF_LENGTH                             0x1
#define _U5ERRIR_U5PERIF_MASK                               0x40
#define _U5ERRIR_U5TXMTIF_POSN                              0x7
#define _U5ERRIR_U5TXMTIF_POSITION                          0x7
#define _U5ERRIR_U5TXMTIF_SIZE                              0x1
#define _U5ERRIR_U5TXMTIF_LENGTH                            0x1
#define _U5ERRIR_U5TXMTIF_MASK                              0x80

// Register: U5ERRIE
#define U5ERRIE U5ERRIE
extern volatile unsigned char           U5ERRIE             __at(0x2FF);
#ifndef _LIB_BUILD
asm("U5ERRIE equ 02FFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIE                  :1;
        unsigned RXFOIE                 :1;
        unsigned RXBKIE                 :1;
        unsigned FERIE                  :1;
        unsigned CERIE                  :1;
        unsigned ABDOVE                 :1;
        unsigned PERIE                  :1;
        unsigned TXMTIE                 :1;
    };
    struct {
        unsigned U5TXCIE                :1;
        unsigned U5RXFOIE               :1;
        unsigned U5RXBKIE               :1;
        unsigned U5FERIE                :1;
        unsigned U5CERIE                :1;
        unsigned U5ABDOVE               :1;
        unsigned U5PERIE                :1;
        unsigned U5TXMTIE               :1;
    };
} U5ERRIEbits_t;
extern volatile U5ERRIEbits_t U5ERRIEbits __at(0x2FF);
// bitfield macros
#define _U5ERRIE_TXCIE_POSN                                 0x0
#define _U5ERRIE_TXCIE_POSITION                             0x0
#define _U5ERRIE_TXCIE_SIZE                                 0x1
#define _U5ERRIE_TXCIE_LENGTH                               0x1
#define _U5ERRIE_TXCIE_MASK                                 0x1
#define _U5ERRIE_RXFOIE_POSN                                0x1
#define _U5ERRIE_RXFOIE_POSITION                            0x1
#define _U5ERRIE_RXFOIE_SIZE                                0x1
#define _U5ERRIE_RXFOIE_LENGTH                              0x1
#define _U5ERRIE_RXFOIE_MASK                                0x2
#define _U5ERRIE_RXBKIE_POSN                                0x2
#define _U5ERRIE_RXBKIE_POSITION                            0x2
#define _U5ERRIE_RXBKIE_SIZE                                0x1
#define _U5ERRIE_RXBKIE_LENGTH                              0x1
#define _U5ERRIE_RXBKIE_MASK                                0x4
#define _U5ERRIE_FERIE_POSN                                 0x3
#define _U5ERRIE_FERIE_POSITION                             0x3
#define _U5ERRIE_FERIE_SIZE                                 0x1
#define _U5ERRIE_FERIE_LENGTH                               0x1
#define _U5ERRIE_FERIE_MASK                                 0x8
#define _U5ERRIE_CERIE_POSN                                 0x4
#define _U5ERRIE_CERIE_POSITION                             0x4
#define _U5ERRIE_CERIE_SIZE                                 0x1
#define _U5ERRIE_CERIE_LENGTH                               0x1
#define _U5ERRIE_CERIE_MASK                                 0x10
#define _U5ERRIE_ABDOVE_POSN                                0x5
#define _U5ERRIE_ABDOVE_POSITION                            0x5
#define _U5ERRIE_ABDOVE_SIZE                                0x1
#define _U5ERRIE_ABDOVE_LENGTH                              0x1
#define _U5ERRIE_ABDOVE_MASK                                0x20
#define _U5ERRIE_PERIE_POSN                                 0x6
#define _U5ERRIE_PERIE_POSITION                             0x6
#define _U5ERRIE_PERIE_SIZE                                 0x1
#define _U5ERRIE_PERIE_LENGTH                               0x1
#define _U5ERRIE_PERIE_MASK                                 0x40
#define _U5ERRIE_TXMTIE_POSN                                0x7
#define _U5ERRIE_TXMTIE_POSITION                            0x7
#define _U5ERRIE_TXMTIE_SIZE                                0x1
#define _U5ERRIE_TXMTIE_LENGTH                              0x1
#define _U5ERRIE_TXMTIE_MASK                                0x80
#define _U5ERRIE_U5TXCIE_POSN                               0x0
#define _U5ERRIE_U5TXCIE_POSITION                           0x0
#define _U5ERRIE_U5TXCIE_SIZE                               0x1
#define _U5ERRIE_U5TXCIE_LENGTH                             0x1
#define _U5ERRIE_U5TXCIE_MASK                               0x1
#define _U5ERRIE_U5RXFOIE_POSN                              0x1
#define _U5ERRIE_U5RXFOIE_POSITION                          0x1
#define _U5ERRIE_U5RXFOIE_SIZE                              0x1
#define _U5ERRIE_U5RXFOIE_LENGTH                            0x1
#define _U5ERRIE_U5RXFOIE_MASK                              0x2
#define _U5ERRIE_U5RXBKIE_POSN                              0x2
#define _U5ERRIE_U5RXBKIE_POSITION                          0x2
#define _U5ERRIE_U5RXBKIE_SIZE                              0x1
#define _U5ERRIE_U5RXBKIE_LENGTH                            0x1
#define _U5ERRIE_U5RXBKIE_MASK                              0x4
#define _U5ERRIE_U5FERIE_POSN                               0x3
#define _U5ERRIE_U5FERIE_POSITION                           0x3
#define _U5ERRIE_U5FERIE_SIZE                               0x1
#define _U5ERRIE_U5FERIE_LENGTH                             0x1
#define _U5ERRIE_U5FERIE_MASK                               0x8
#define _U5ERRIE_U5CERIE_POSN                               0x4
#define _U5ERRIE_U5CERIE_POSITION                           0x4
#define _U5ERRIE_U5CERIE_SIZE                               0x1
#define _U5ERRIE_U5CERIE_LENGTH                             0x1
#define _U5ERRIE_U5CERIE_MASK                               0x10
#define _U5ERRIE_U5ABDOVE_POSN                              0x5
#define _U5ERRIE_U5ABDOVE_POSITION                          0x5
#define _U5ERRIE_U5ABDOVE_SIZE                              0x1
#define _U5ERRIE_U5ABDOVE_LENGTH                            0x1
#define _U5ERRIE_U5ABDOVE_MASK                              0x20
#define _U5ERRIE_U5PERIE_POSN                               0x6
#define _U5ERRIE_U5PERIE_POSITION                           0x6
#define _U5ERRIE_U5PERIE_SIZE                               0x1
#define _U5ERRIE_U5PERIE_LENGTH                             0x1
#define _U5ERRIE_U5PERIE_MASK                               0x40
#define _U5ERRIE_U5TXMTIE_POSN                              0x7
#define _U5ERRIE_U5TXMTIE_POSITION                          0x7
#define _U5ERRIE_U5TXMTIE_SIZE                              0x1
#define _U5ERRIE_U5TXMTIE_LENGTH                            0x1
#define _U5ERRIE_U5TXMTIE_MASK                              0x80

// Register: SMT1TMR
#define SMT1TMR SMT1TMR
#ifndef __CCI__
extern volatile __uint24                SMT1TMR             __at(0x300);
#endif
#ifndef _LIB_BUILD
asm("SMT1TMR equ 0300h");
#endif

