GopalSaraf/Practicals/PSDL/include/proc/pic18f56q43.h
extern volatile CWG3STRbits_t CWG3STRbits __at(0x3D6);
// bitfield macros
#define _CWG3STR_STRA_POSN                                  0x0
#define _CWG3STR_STRA_POSITION                              0x0
#define _CWG3STR_STRA_SIZE                                  0x1
#define _CWG3STR_STRA_LENGTH                                0x1
#define _CWG3STR_STRA_MASK                                  0x1
#define _CWG3STR_STRB_POSN                                  0x1
#define _CWG3STR_STRB_POSITION                              0x1
#define _CWG3STR_STRB_SIZE                                  0x1
#define _CWG3STR_STRB_LENGTH                                0x1
#define _CWG3STR_STRB_MASK                                  0x2
#define _CWG3STR_STRC_POSN                                  0x2
#define _CWG3STR_STRC_POSITION                              0x2
#define _CWG3STR_STRC_SIZE                                  0x1
#define _CWG3STR_STRC_LENGTH                                0x1
#define _CWG3STR_STRC_MASK                                  0x4
#define _CWG3STR_STRD_POSN                                  0x3
#define _CWG3STR_STRD_POSITION                              0x3
#define _CWG3STR_STRD_SIZE                                  0x1
#define _CWG3STR_STRD_LENGTH                                0x1
#define _CWG3STR_STRD_MASK                                  0x8
#define _CWG3STR_OVRA_POSN                                  0x4
#define _CWG3STR_OVRA_POSITION                              0x4
#define _CWG3STR_OVRA_SIZE                                  0x1
#define _CWG3STR_OVRA_LENGTH                                0x1
#define _CWG3STR_OVRA_MASK                                  0x10
#define _CWG3STR_OVRB_POSN                                  0x5
#define _CWG3STR_OVRB_POSITION                              0x5
#define _CWG3STR_OVRB_SIZE                                  0x1
#define _CWG3STR_OVRB_LENGTH                                0x1
#define _CWG3STR_OVRB_MASK                                  0x20
#define _CWG3STR_OVRC_POSN                                  0x6
#define _CWG3STR_OVRC_POSITION                              0x6
#define _CWG3STR_OVRC_SIZE                                  0x1
#define _CWG3STR_OVRC_LENGTH                                0x1
#define _CWG3STR_OVRC_MASK                                  0x40
#define _CWG3STR_OVRD_POSN                                  0x7
#define _CWG3STR_OVRD_POSITION                              0x7
#define _CWG3STR_OVRD_SIZE                                  0x1
#define _CWG3STR_OVRD_LENGTH                                0x1
#define _CWG3STR_OVRD_MASK                                  0x80
#define _CWG3STR_CWG3STRA_POSN                              0x0
#define _CWG3STR_CWG3STRA_POSITION                          0x0
#define _CWG3STR_CWG3STRA_SIZE                              0x1
#define _CWG3STR_CWG3STRA_LENGTH                            0x1
#define _CWG3STR_CWG3STRA_MASK                              0x1
#define _CWG3STR_CWG3STRB_POSN                              0x1
#define _CWG3STR_CWG3STRB_POSITION                          0x1
#define _CWG3STR_CWG3STRB_SIZE                              0x1
#define _CWG3STR_CWG3STRB_LENGTH                            0x1
#define _CWG3STR_CWG3STRB_MASK                              0x2
#define _CWG3STR_CWG3STRC_POSN                              0x2
#define _CWG3STR_CWG3STRC_POSITION                          0x2
#define _CWG3STR_CWG3STRC_SIZE                              0x1
#define _CWG3STR_CWG3STRC_LENGTH                            0x1
#define _CWG3STR_CWG3STRC_MASK                              0x4
#define _CWG3STR_CWG3STRD_POSN                              0x3
#define _CWG3STR_CWG3STRD_POSITION                          0x3
#define _CWG3STR_CWG3STRD_SIZE                              0x1
#define _CWG3STR_CWG3STRD_LENGTH                            0x1
#define _CWG3STR_CWG3STRD_MASK                              0x8
#define _CWG3STR_CWG3OVRA_POSN                              0x4
#define _CWG3STR_CWG3OVRA_POSITION                          0x4
#define _CWG3STR_CWG3OVRA_SIZE                              0x1
#define _CWG3STR_CWG3OVRA_LENGTH                            0x1
#define _CWG3STR_CWG3OVRA_MASK                              0x10
#define _CWG3STR_CWG3OVRB_POSN                              0x5
#define _CWG3STR_CWG3OVRB_POSITION                          0x5
#define _CWG3STR_CWG3OVRB_SIZE                              0x1
#define _CWG3STR_CWG3OVRB_LENGTH                            0x1
#define _CWG3STR_CWG3OVRB_MASK                              0x20
#define _CWG3STR_CWG3OVRC_POSN                              0x6
#define _CWG3STR_CWG3OVRC_POSITION                          0x6
#define _CWG3STR_CWG3OVRC_SIZE                              0x1
#define _CWG3STR_CWG3OVRC_LENGTH                            0x1
#define _CWG3STR_CWG3OVRC_MASK                              0x40
#define _CWG3STR_CWG3OVRD_POSN                              0x7
#define _CWG3STR_CWG3OVRD_POSITION                          0x7
#define _CWG3STR_CWG3OVRD_SIZE                              0x1
#define _CWG3STR_CWG3OVRD_LENGTH                            0x1
#define _CWG3STR_CWG3OVRD_MASK                              0x80

// Register: FVRCON
#define FVRCON FVRCON
extern volatile unsigned char           FVRCON              __at(0x3D7);
#ifndef _LIB_BUILD
asm("FVRCON equ 03D7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADFVR                  :2;
        unsigned CDAFVR                 :2;
        unsigned TSRNG                  :1;
        unsigned TSEN                   :1;
        unsigned RDY                    :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned ADFVR0                 :1;
        unsigned ADFVR1                 :1;
        unsigned CDAFVR0                :1;
        unsigned CDAFVR1                :1;
        unsigned                        :2;
        unsigned FVRRDY                 :1;
        unsigned FVREN                  :1;
    };
} FVRCONbits_t;
extern volatile FVRCONbits_t FVRCONbits __at(0x3D7);
// bitfield macros
#define _FVRCON_ADFVR_POSN                                  0x0
#define _FVRCON_ADFVR_POSITION                              0x0
#define _FVRCON_ADFVR_SIZE                                  0x2
#define _FVRCON_ADFVR_LENGTH                                0x2
#define _FVRCON_ADFVR_MASK                                  0x3
#define _FVRCON_CDAFVR_POSN                                 0x2
#define _FVRCON_CDAFVR_POSITION                             0x2
#define _FVRCON_CDAFVR_SIZE                                 0x2
#define _FVRCON_CDAFVR_LENGTH                               0x2
#define _FVRCON_CDAFVR_MASK                                 0xC
#define _FVRCON_TSRNG_POSN                                  0x4
#define _FVRCON_TSRNG_POSITION                              0x4
#define _FVRCON_TSRNG_SIZE                                  0x1
#define _FVRCON_TSRNG_LENGTH                                0x1
#define _FVRCON_TSRNG_MASK                                  0x10
#define _FVRCON_TSEN_POSN                                   0x5
#define _FVRCON_TSEN_POSITION                               0x5
#define _FVRCON_TSEN_SIZE                                   0x1
#define _FVRCON_TSEN_LENGTH                                 0x1
#define _FVRCON_TSEN_MASK                                   0x20
#define _FVRCON_RDY_POSN                                    0x6
#define _FVRCON_RDY_POSITION                                0x6
#define _FVRCON_RDY_SIZE                                    0x1
#define _FVRCON_RDY_LENGTH                                  0x1
#define _FVRCON_RDY_MASK                                    0x40
#define _FVRCON_EN_POSN                                     0x7
#define _FVRCON_EN_POSITION                                 0x7
#define _FVRCON_EN_SIZE                                     0x1
#define _FVRCON_EN_LENGTH                                   0x1
#define _FVRCON_EN_MASK                                     0x80
#define _FVRCON_ADFVR0_POSN                                 0x0
#define _FVRCON_ADFVR0_POSITION                             0x0
#define _FVRCON_ADFVR0_SIZE                                 0x1
#define _FVRCON_ADFVR0_LENGTH                               0x1
#define _FVRCON_ADFVR0_MASK                                 0x1
#define _FVRCON_ADFVR1_POSN                                 0x1
#define _FVRCON_ADFVR1_POSITION                             0x1
#define _FVRCON_ADFVR1_SIZE                                 0x1
#define _FVRCON_ADFVR1_LENGTH                               0x1
#define _FVRCON_ADFVR1_MASK                                 0x2
#define _FVRCON_CDAFVR0_POSN                                0x2
#define _FVRCON_CDAFVR0_POSITION                            0x2
#define _FVRCON_CDAFVR0_SIZE                                0x1
#define _FVRCON_CDAFVR0_LENGTH                              0x1
#define _FVRCON_CDAFVR0_MASK                                0x4
#define _FVRCON_CDAFVR1_POSN                                0x3
#define _FVRCON_CDAFVR1_POSITION                            0x3
#define _FVRCON_CDAFVR1_SIZE                                0x1
#define _FVRCON_CDAFVR1_LENGTH                              0x1
#define _FVRCON_CDAFVR1_MASK                                0x8
#define _FVRCON_FVRRDY_POSN                                 0x6
#define _FVRCON_FVRRDY_POSITION                             0x6
#define _FVRCON_FVRRDY_SIZE                                 0x1
#define _FVRCON_FVRRDY_LENGTH                               0x1
#define _FVRCON_FVRRDY_MASK                                 0x40
#define _FVRCON_FVREN_POSN                                  0x7
#define _FVRCON_FVREN_POSITION                              0x7
#define _FVRCON_FVREN_SIZE                                  0x1
#define _FVRCON_FVREN_LENGTH                                0x1
#define _FVRCON_FVREN_MASK                                  0x80

// Register: ADCPCON
#define ADCPCON ADCPCON
extern volatile unsigned char           ADCPCON             __at(0x3D8);
#ifndef _LIB_BUILD
asm("ADCPCON equ 03D8h");
#endif
// aliases
extern volatile unsigned char           ADCP                __at(0x3D8);
#ifndef _LIB_BUILD
asm("ADCP equ 03D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRDY                  :1;
        unsigned                        :6;
        unsigned ON                     :1;
    };
    struct {
        unsigned ADCPRDY                :1;
        unsigned                        :6;
        unsigned CPON                   :1;
    };
    struct {
        unsigned                        :7;
        unsigned ADCPON                 :1;
    };
} ADCPCONbits_t;
extern volatile ADCPCONbits_t ADCPCONbits __at(0x3D8);
// bitfield macros
#define _ADCPCON_CPRDY_POSN                                 0x0
#define _ADCPCON_CPRDY_POSITION                             0x0
#define _ADCPCON_CPRDY_SIZE                                 0x1
#define _ADCPCON_CPRDY_LENGTH                               0x1
#define _ADCPCON_CPRDY_MASK                                 0x1
#define _ADCPCON_ON_POSN                                    0x7
#define _ADCPCON_ON_POSITION                                0x7
#define _ADCPCON_ON_SIZE                                    0x1
#define _ADCPCON_ON_LENGTH                                  0x1
#define _ADCPCON_ON_MASK                                    0x80
#define _ADCPCON_ADCPRDY_POSN                               0x0
#define _ADCPCON_ADCPRDY_POSITION                           0x0
#define _ADCPCON_ADCPRDY_SIZE                               0x1
#define _ADCPCON_ADCPRDY_LENGTH                             0x1
#define _ADCPCON_ADCPRDY_MASK                               0x1
#define _ADCPCON_CPON_POSN                                  0x7
#define _ADCPCON_CPON_POSITION                              0x7
#define _ADCPCON_CPON_SIZE                                  0x1
#define _ADCPCON_CPON_LENGTH                                0x1
#define _ADCPCON_CPON_MASK                                  0x80
#define _ADCPCON_ADCPON_POSN                                0x7
#define _ADCPCON_ADCPON_POSITION                            0x7
#define _ADCPCON_ADCPON_SIZE                                0x1
#define _ADCPCON_ADCPON_LENGTH                              0x1
#define _ADCPCON_ADCPON_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned CPRDY                  :1;
        unsigned                        :6;
        unsigned ON                     :1;
    };
    struct {
        unsigned ADCPRDY                :1;
        unsigned                        :6;
        unsigned CPON                   :1;
    };
    struct {
        unsigned                        :7;
        unsigned ADCPON                 :1;
    };
} ADCPbits_t;
extern volatile ADCPbits_t ADCPbits __at(0x3D8);
// bitfield macros
#define _ADCP_CPRDY_POSN                                    0x0
#define _ADCP_CPRDY_POSITION                                0x0
#define _ADCP_CPRDY_SIZE                                    0x1
#define _ADCP_CPRDY_LENGTH                                  0x1
#define _ADCP_CPRDY_MASK                                    0x1
#define _ADCP_ON_POSN                                       0x7
#define _ADCP_ON_POSITION                                   0x7
#define _ADCP_ON_SIZE                                       0x1
#define _ADCP_ON_LENGTH                                     0x1
#define _ADCP_ON_MASK                                       0x80
#define _ADCP_ADCPRDY_POSN                                  0x0
#define _ADCP_ADCPRDY_POSITION                              0x0
#define _ADCP_ADCPRDY_SIZE                                  0x1
#define _ADCP_ADCPRDY_LENGTH                                0x1
#define _ADCP_ADCPRDY_MASK                                  0x1
#define _ADCP_CPON_POSN                                     0x7
#define _ADCP_CPON_POSITION                                 0x7
#define _ADCP_CPON_SIZE                                     0x1
#define _ADCP_CPON_LENGTH                                   0x1
#define _ADCP_CPON_MASK                                     0x80
#define _ADCP_ADCPON_POSN                                   0x7
#define _ADCP_ADCPON_POSITION                               0x7
#define _ADCP_ADCPON_SIZE                                   0x1
#define _ADCP_ADCPON_LENGTH                                 0x1
#define _ADCP_ADCPON_MASK                                   0x80

// Register: ADLTH
#define ADLTH ADLTH
extern volatile unsigned short          ADLTH               __at(0x3D9);
#ifndef _LIB_BUILD
asm("ADLTH equ 03D9h");
#endif

// Register: ADLTHL
#define ADLTHL ADLTHL
extern volatile unsigned char           ADLTHL              __at(0x3D9);
#ifndef _LIB_BUILD
asm("ADLTHL equ 03D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LTH                    :8;
    };
    struct {
        unsigned ADLTH0                 :1;
        unsigned ADLTH1                 :1;
        unsigned ADLTH2                 :1;
        unsigned ADLTH3                 :1;
        unsigned ADLTH4                 :1;
        unsigned ADLTH5                 :1;
        unsigned ADLTH6                 :1;
        unsigned ADLTH7                 :1;
    };
    struct {
        unsigned ADLTH                  :8;
    };
    struct {
        unsigned LTH0                   :1;
        unsigned LTH1                   :1;
        unsigned LTH2                   :1;
        unsigned LTH3                   :1;
        unsigned LTH4                   :1;
        unsigned LTH5                   :1;
        unsigned LTH6                   :1;
        unsigned LTH7                   :1;
    };
} ADLTHLbits_t;
extern volatile ADLTHLbits_t ADLTHLbits __at(0x3D9);
// bitfield macros
#define _ADLTHL_LTH_POSN                                    0x0
#define _ADLTHL_LTH_POSITION                                0x0
#define _ADLTHL_LTH_SIZE                                    0x8
#define _ADLTHL_LTH_LENGTH                                  0x8
#define _ADLTHL_LTH_MASK                                    0xFF
#define _ADLTHL_ADLTH0_POSN                                 0x0
#define _ADLTHL_ADLTH0_POSITION                             0x0
#define _ADLTHL_ADLTH0_SIZE                                 0x1
#define _ADLTHL_ADLTH0_LENGTH                               0x1
#define _ADLTHL_ADLTH0_MASK                                 0x1
#define _ADLTHL_ADLTH1_POSN                                 0x1
#define _ADLTHL_ADLTH1_POSITION                             0x1
#define _ADLTHL_ADLTH1_SIZE                                 0x1
#define _ADLTHL_ADLTH1_LENGTH                               0x1
#define _ADLTHL_ADLTH1_MASK                                 0x2
#define _ADLTHL_ADLTH2_POSN                                 0x2
#define _ADLTHL_ADLTH2_POSITION                             0x2
#define _ADLTHL_ADLTH2_SIZE                                 0x1
#define _ADLTHL_ADLTH2_LENGTH                               0x1
#define _ADLTHL_ADLTH2_MASK                                 0x4
#define _ADLTHL_ADLTH3_POSN                                 0x3
#define _ADLTHL_ADLTH3_POSITION                             0x3
#define _ADLTHL_ADLTH3_SIZE                                 0x1
#define _ADLTHL_ADLTH3_LENGTH                               0x1
#define _ADLTHL_ADLTH3_MASK                                 0x8
#define _ADLTHL_ADLTH4_POSN                                 0x4
#define _ADLTHL_ADLTH4_POSITION                             0x4
#define _ADLTHL_ADLTH4_SIZE                                 0x1
#define _ADLTHL_ADLTH4_LENGTH                               0x1
#define _ADLTHL_ADLTH4_MASK                                 0x10
#define _ADLTHL_ADLTH5_POSN                                 0x5
#define _ADLTHL_ADLTH5_POSITION                             0x5
#define _ADLTHL_ADLTH5_SIZE                                 0x1
#define _ADLTHL_ADLTH5_LENGTH                               0x1
#define _ADLTHL_ADLTH5_MASK                                 0x20
#define _ADLTHL_ADLTH6_POSN                                 0x6
#define _ADLTHL_ADLTH6_POSITION                             0x6
#define _ADLTHL_ADLTH6_SIZE                                 0x1
#define _ADLTHL_ADLTH6_LENGTH                               0x1
#define _ADLTHL_ADLTH6_MASK                                 0x40
#define _ADLTHL_ADLTH7_POSN                                 0x7
#define _ADLTHL_ADLTH7_POSITION                             0x7
#define _ADLTHL_ADLTH7_SIZE                                 0x1
#define _ADLTHL_ADLTH7_LENGTH                               0x1
#define _ADLTHL_ADLTH7_MASK                                 0x80
#define _ADLTHL_ADLTH_POSN                                  0x0
#define _ADLTHL_ADLTH_POSITION                              0x0
#define _ADLTHL_ADLTH_SIZE                                  0x8
#define _ADLTHL_ADLTH_LENGTH                                0x8
#define _ADLTHL_ADLTH_MASK                                  0xFF
#define _ADLTHL_LTH0_POSN                                   0x0
#define _ADLTHL_LTH0_POSITION                               0x0
#define _ADLTHL_LTH0_SIZE                                   0x1
#define _ADLTHL_LTH0_LENGTH                                 0x1
#define _ADLTHL_LTH0_MASK                                   0x1
#define _ADLTHL_LTH1_POSN                                   0x1
#define _ADLTHL_LTH1_POSITION                               0x1
#define _ADLTHL_LTH1_SIZE                                   0x1
#define _ADLTHL_LTH1_LENGTH                                 0x1
#define _ADLTHL_LTH1_MASK                                   0x2
#define _ADLTHL_LTH2_POSN                                   0x2
#define _ADLTHL_LTH2_POSITION                               0x2
#define _ADLTHL_LTH2_SIZE                                   0x1
#define _ADLTHL_LTH2_LENGTH                                 0x1
#define _ADLTHL_LTH2_MASK                                   0x4
#define _ADLTHL_LTH3_POSN                                   0x3
#define _ADLTHL_LTH3_POSITION                               0x3
#define _ADLTHL_LTH3_SIZE                                   0x1
#define _ADLTHL_LTH3_LENGTH                                 0x1
#define _ADLTHL_LTH3_MASK                                   0x8
#define _ADLTHL_LTH4_POSN                                   0x4
#define _ADLTHL_LTH4_POSITION                               0x4
#define _ADLTHL_LTH4_SIZE                                   0x1
#define _ADLTHL_LTH4_LENGTH                                 0x1
#define _ADLTHL_LTH4_MASK                                   0x10
#define _ADLTHL_LTH5_POSN                                   0x5
#define _ADLTHL_LTH5_POSITION                               0x5
#define _ADLTHL_LTH5_SIZE                                   0x1
#define _ADLTHL_LTH5_LENGTH                                 0x1
#define _ADLTHL_LTH5_MASK                                   0x20
#define _ADLTHL_LTH6_POSN                                   0x6
#define _ADLTHL_LTH6_POSITION                               0x6
#define _ADLTHL_LTH6_SIZE                                   0x1
#define _ADLTHL_LTH6_LENGTH                                 0x1
#define _ADLTHL_LTH6_MASK                                   0x40
#define _ADLTHL_LTH7_POSN                                   0x7
#define _ADLTHL_LTH7_POSITION                               0x7
#define _ADLTHL_LTH7_SIZE                                   0x1
#define _ADLTHL_LTH7_LENGTH                                 0x1
#define _ADLTHL_LTH7_MASK                                   0x80

// Register: ADLTHH
#define ADLTHH ADLTHH
extern volatile unsigned char           ADLTHH              __at(0x3DA);
#ifndef _LIB_BUILD
asm("ADLTHH equ 03DAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LTH                    :8;
    };
    struct {
        unsigned ADLTH8                 :1;
        unsigned ADLTH9                 :1;
        unsigned ADLTH10                :1;
        unsigned ADLTH11                :1;
        unsigned ADLTH12                :1;
        unsigned ADLTH13                :1;
        unsigned ADLTH14                :1;
        unsigned ADLTH15                :1;
    };
    struct {
        unsigned ADLTH                  :8;
    };
    struct {
        unsigned LTH8                   :1;
        unsigned LTH9                   :1;
        unsigned LTH10                  :1;
        unsigned LTH11                  :1;
        unsigned LTH12                  :1;
        unsigned LTH13                  :1;
        unsigned LTH14                  :1;
        unsigned LTH15                  :1;
    };
} ADLTHHbits_t;
