GopalSaraf/Practicals/PSDL/include/proc/pic18f56q43.h
// Register: NCO2ACCU
#define NCO2ACCU NCO2ACCU
extern volatile unsigned char           NCO2ACCU            __at(0x44A);
#ifndef _LIB_BUILD
asm("NCO2ACCU equ 044Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :4;
    };
    struct {
        unsigned NCO2ACC16              :1;
        unsigned NCO2ACC17              :1;
        unsigned NCO2ACC18              :1;
        unsigned NCO2ACC19              :1;
    };
    struct {
        unsigned ACC16                  :1;
        unsigned ACC17                  :1;
        unsigned ACC18                  :1;
        unsigned ACC19                  :1;
    };
    struct {
        unsigned NCO2ACC                :4;
    };
} NCO2ACCUbits_t;
extern volatile NCO2ACCUbits_t NCO2ACCUbits __at(0x44A);
// bitfield macros
#define _NCO2ACCU_ACC_POSN                                  0x0
#define _NCO2ACCU_ACC_POSITION                              0x0
#define _NCO2ACCU_ACC_SIZE                                  0x4
#define _NCO2ACCU_ACC_LENGTH                                0x4
#define _NCO2ACCU_ACC_MASK                                  0xF
#define _NCO2ACCU_NCO2ACC16_POSN                            0x0
#define _NCO2ACCU_NCO2ACC16_POSITION                        0x0
#define _NCO2ACCU_NCO2ACC16_SIZE                            0x1
#define _NCO2ACCU_NCO2ACC16_LENGTH                          0x1
#define _NCO2ACCU_NCO2ACC16_MASK                            0x1
#define _NCO2ACCU_NCO2ACC17_POSN                            0x1
#define _NCO2ACCU_NCO2ACC17_POSITION                        0x1
#define _NCO2ACCU_NCO2ACC17_SIZE                            0x1
#define _NCO2ACCU_NCO2ACC17_LENGTH                          0x1
#define _NCO2ACCU_NCO2ACC17_MASK                            0x2
#define _NCO2ACCU_NCO2ACC18_POSN                            0x2
#define _NCO2ACCU_NCO2ACC18_POSITION                        0x2
#define _NCO2ACCU_NCO2ACC18_SIZE                            0x1
#define _NCO2ACCU_NCO2ACC18_LENGTH                          0x1
#define _NCO2ACCU_NCO2ACC18_MASK                            0x4
#define _NCO2ACCU_NCO2ACC19_POSN                            0x3
#define _NCO2ACCU_NCO2ACC19_POSITION                        0x3
#define _NCO2ACCU_NCO2ACC19_SIZE                            0x1
#define _NCO2ACCU_NCO2ACC19_LENGTH                          0x1
#define _NCO2ACCU_NCO2ACC19_MASK                            0x8
#define _NCO2ACCU_ACC16_POSN                                0x0
#define _NCO2ACCU_ACC16_POSITION                            0x0
#define _NCO2ACCU_ACC16_SIZE                                0x1
#define _NCO2ACCU_ACC16_LENGTH                              0x1
#define _NCO2ACCU_ACC16_MASK                                0x1
#define _NCO2ACCU_ACC17_POSN                                0x1
#define _NCO2ACCU_ACC17_POSITION                            0x1
#define _NCO2ACCU_ACC17_SIZE                                0x1
#define _NCO2ACCU_ACC17_LENGTH                              0x1
#define _NCO2ACCU_ACC17_MASK                                0x2
#define _NCO2ACCU_ACC18_POSN                                0x2
#define _NCO2ACCU_ACC18_POSITION                            0x2
#define _NCO2ACCU_ACC18_SIZE                                0x1
#define _NCO2ACCU_ACC18_LENGTH                              0x1
#define _NCO2ACCU_ACC18_MASK                                0x4
#define _NCO2ACCU_ACC19_POSN                                0x3
#define _NCO2ACCU_ACC19_POSITION                            0x3
#define _NCO2ACCU_ACC19_SIZE                                0x1
#define _NCO2ACCU_ACC19_LENGTH                              0x1
#define _NCO2ACCU_ACC19_MASK                                0x8
#define _NCO2ACCU_NCO2ACC_POSN                              0x0
#define _NCO2ACCU_NCO2ACC_POSITION                          0x0
#define _NCO2ACCU_NCO2ACC_SIZE                              0x4
#define _NCO2ACCU_NCO2ACC_LENGTH                            0x4
#define _NCO2ACCU_NCO2ACC_MASK                              0xF

// Register: NCO2INC
#define NCO2INC NCO2INC
#ifndef __CCI__
extern volatile __uint24                NCO2INC             __at(0x44B);
#endif
#ifndef _LIB_BUILD
asm("NCO2INC equ 044Bh");
#endif

// Register: NCO2INCL
#define NCO2INCL NCO2INCL
extern volatile unsigned char           NCO2INCL            __at(0x44B);
#ifndef _LIB_BUILD
asm("NCO2INCL equ 044Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO2INC0               :1;
        unsigned NCO2INC1               :1;
        unsigned NCO2INC2               :1;
        unsigned NCO2INC3               :1;
        unsigned NCO2INC4               :1;
        unsigned NCO2INC5               :1;
        unsigned NCO2INC6               :1;
        unsigned NCO2INC7               :1;
    };
    struct {
        unsigned INC0                   :1;
        unsigned INC1                   :1;
        unsigned INC2                   :1;
        unsigned INC3                   :1;
        unsigned INC4                   :1;
        unsigned INC5                   :1;
        unsigned INC6                   :1;
        unsigned INC7                   :1;
    };
    struct {
        unsigned NCO2INC                :8;
    };
} NCO2INCLbits_t;
extern volatile NCO2INCLbits_t NCO2INCLbits __at(0x44B);
// bitfield macros
#define _NCO2INCL_INC_POSN                                  0x0
#define _NCO2INCL_INC_POSITION                              0x0
#define _NCO2INCL_INC_SIZE                                  0x8
#define _NCO2INCL_INC_LENGTH                                0x8
#define _NCO2INCL_INC_MASK                                  0xFF
#define _NCO2INCL_NCO2INC0_POSN                             0x0
#define _NCO2INCL_NCO2INC0_POSITION                         0x0
#define _NCO2INCL_NCO2INC0_SIZE                             0x1
#define _NCO2INCL_NCO2INC0_LENGTH                           0x1
#define _NCO2INCL_NCO2INC0_MASK                             0x1
#define _NCO2INCL_NCO2INC1_POSN                             0x1
#define _NCO2INCL_NCO2INC1_POSITION                         0x1
#define _NCO2INCL_NCO2INC1_SIZE                             0x1
#define _NCO2INCL_NCO2INC1_LENGTH                           0x1
#define _NCO2INCL_NCO2INC1_MASK                             0x2
#define _NCO2INCL_NCO2INC2_POSN                             0x2
#define _NCO2INCL_NCO2INC2_POSITION                         0x2
#define _NCO2INCL_NCO2INC2_SIZE                             0x1
#define _NCO2INCL_NCO2INC2_LENGTH                           0x1
#define _NCO2INCL_NCO2INC2_MASK                             0x4
#define _NCO2INCL_NCO2INC3_POSN                             0x3
#define _NCO2INCL_NCO2INC3_POSITION                         0x3
#define _NCO2INCL_NCO2INC3_SIZE                             0x1
#define _NCO2INCL_NCO2INC3_LENGTH                           0x1
#define _NCO2INCL_NCO2INC3_MASK                             0x8
#define _NCO2INCL_NCO2INC4_POSN                             0x4
#define _NCO2INCL_NCO2INC4_POSITION                         0x4
#define _NCO2INCL_NCO2INC4_SIZE                             0x1
#define _NCO2INCL_NCO2INC4_LENGTH                           0x1
#define _NCO2INCL_NCO2INC4_MASK                             0x10
#define _NCO2INCL_NCO2INC5_POSN                             0x5
#define _NCO2INCL_NCO2INC5_POSITION                         0x5
#define _NCO2INCL_NCO2INC5_SIZE                             0x1
#define _NCO2INCL_NCO2INC5_LENGTH                           0x1
#define _NCO2INCL_NCO2INC5_MASK                             0x20
#define _NCO2INCL_NCO2INC6_POSN                             0x6
#define _NCO2INCL_NCO2INC6_POSITION                         0x6
#define _NCO2INCL_NCO2INC6_SIZE                             0x1
#define _NCO2INCL_NCO2INC6_LENGTH                           0x1
#define _NCO2INCL_NCO2INC6_MASK                             0x40
#define _NCO2INCL_NCO2INC7_POSN                             0x7
#define _NCO2INCL_NCO2INC7_POSITION                         0x7
#define _NCO2INCL_NCO2INC7_SIZE                             0x1
#define _NCO2INCL_NCO2INC7_LENGTH                           0x1
#define _NCO2INCL_NCO2INC7_MASK                             0x80
#define _NCO2INCL_INC0_POSN                                 0x0
#define _NCO2INCL_INC0_POSITION                             0x0
#define _NCO2INCL_INC0_SIZE                                 0x1
#define _NCO2INCL_INC0_LENGTH                               0x1
#define _NCO2INCL_INC0_MASK                                 0x1
#define _NCO2INCL_INC1_POSN                                 0x1
#define _NCO2INCL_INC1_POSITION                             0x1
#define _NCO2INCL_INC1_SIZE                                 0x1
#define _NCO2INCL_INC1_LENGTH                               0x1
#define _NCO2INCL_INC1_MASK                                 0x2
#define _NCO2INCL_INC2_POSN                                 0x2
#define _NCO2INCL_INC2_POSITION                             0x2
#define _NCO2INCL_INC2_SIZE                                 0x1
#define _NCO2INCL_INC2_LENGTH                               0x1
#define _NCO2INCL_INC2_MASK                                 0x4
#define _NCO2INCL_INC3_POSN                                 0x3
#define _NCO2INCL_INC3_POSITION                             0x3
#define _NCO2INCL_INC3_SIZE                                 0x1
#define _NCO2INCL_INC3_LENGTH                               0x1
#define _NCO2INCL_INC3_MASK                                 0x8
#define _NCO2INCL_INC4_POSN                                 0x4
#define _NCO2INCL_INC4_POSITION                             0x4
#define _NCO2INCL_INC4_SIZE                                 0x1
#define _NCO2INCL_INC4_LENGTH                               0x1
#define _NCO2INCL_INC4_MASK                                 0x10
#define _NCO2INCL_INC5_POSN                                 0x5
#define _NCO2INCL_INC5_POSITION                             0x5
#define _NCO2INCL_INC5_SIZE                                 0x1
#define _NCO2INCL_INC5_LENGTH                               0x1
#define _NCO2INCL_INC5_MASK                                 0x20
#define _NCO2INCL_INC6_POSN                                 0x6
#define _NCO2INCL_INC6_POSITION                             0x6
#define _NCO2INCL_INC6_SIZE                                 0x1
#define _NCO2INCL_INC6_LENGTH                               0x1
#define _NCO2INCL_INC6_MASK                                 0x40
#define _NCO2INCL_INC7_POSN                                 0x7
#define _NCO2INCL_INC7_POSITION                             0x7
#define _NCO2INCL_INC7_SIZE                                 0x1
#define _NCO2INCL_INC7_LENGTH                               0x1
#define _NCO2INCL_INC7_MASK                                 0x80
#define _NCO2INCL_NCO2INC_POSN                              0x0
#define _NCO2INCL_NCO2INC_POSITION                          0x0
#define _NCO2INCL_NCO2INC_SIZE                              0x8
#define _NCO2INCL_NCO2INC_LENGTH                            0x8
#define _NCO2INCL_NCO2INC_MASK                              0xFF

// Register: NCO2INCH
#define NCO2INCH NCO2INCH
extern volatile unsigned char           NCO2INCH            __at(0x44C);
#ifndef _LIB_BUILD
asm("NCO2INCH equ 044Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO2INC8               :1;
        unsigned NCO2INC9               :1;
        unsigned NCO2INC10              :1;
        unsigned NCO2INC11              :1;
        unsigned NCO2INC12              :1;
        unsigned NCO2INC13              :1;
        unsigned NCO2INC14              :1;
        unsigned NCO2INC15              :1;
    };
    struct {
        unsigned INC8                   :1;
        unsigned INC9                   :1;
        unsigned INC10                  :1;
        unsigned INC11                  :1;
        unsigned INC12                  :1;
        unsigned INC13                  :1;
        unsigned INC14                  :1;
        unsigned INC15                  :1;
    };
    struct {
        unsigned NCO2INC                :8;
    };
} NCO2INCHbits_t;
extern volatile NCO2INCHbits_t NCO2INCHbits __at(0x44C);
// bitfield macros
#define _NCO2INCH_INC_POSN                                  0x0
#define _NCO2INCH_INC_POSITION                              0x0
#define _NCO2INCH_INC_SIZE                                  0x8
#define _NCO2INCH_INC_LENGTH                                0x8
#define _NCO2INCH_INC_MASK                                  0xFF
#define _NCO2INCH_NCO2INC8_POSN                             0x0
#define _NCO2INCH_NCO2INC8_POSITION                         0x0
#define _NCO2INCH_NCO2INC8_SIZE                             0x1
#define _NCO2INCH_NCO2INC8_LENGTH                           0x1
#define _NCO2INCH_NCO2INC8_MASK                             0x1
#define _NCO2INCH_NCO2INC9_POSN                             0x1
#define _NCO2INCH_NCO2INC9_POSITION                         0x1
#define _NCO2INCH_NCO2INC9_SIZE                             0x1
#define _NCO2INCH_NCO2INC9_LENGTH                           0x1
#define _NCO2INCH_NCO2INC9_MASK                             0x2
#define _NCO2INCH_NCO2INC10_POSN                            0x2
#define _NCO2INCH_NCO2INC10_POSITION                        0x2
#define _NCO2INCH_NCO2INC10_SIZE                            0x1
#define _NCO2INCH_NCO2INC10_LENGTH                          0x1
#define _NCO2INCH_NCO2INC10_MASK                            0x4
#define _NCO2INCH_NCO2INC11_POSN                            0x3
#define _NCO2INCH_NCO2INC11_POSITION                        0x3
#define _NCO2INCH_NCO2INC11_SIZE                            0x1
#define _NCO2INCH_NCO2INC11_LENGTH                          0x1
#define _NCO2INCH_NCO2INC11_MASK                            0x8
#define _NCO2INCH_NCO2INC12_POSN                            0x4
#define _NCO2INCH_NCO2INC12_POSITION                        0x4
#define _NCO2INCH_NCO2INC12_SIZE                            0x1
#define _NCO2INCH_NCO2INC12_LENGTH                          0x1
#define _NCO2INCH_NCO2INC12_MASK                            0x10
#define _NCO2INCH_NCO2INC13_POSN                            0x5
#define _NCO2INCH_NCO2INC13_POSITION                        0x5
#define _NCO2INCH_NCO2INC13_SIZE                            0x1
#define _NCO2INCH_NCO2INC13_LENGTH                          0x1
#define _NCO2INCH_NCO2INC13_MASK                            0x20
#define _NCO2INCH_NCO2INC14_POSN                            0x6
#define _NCO2INCH_NCO2INC14_POSITION                        0x6
#define _NCO2INCH_NCO2INC14_SIZE                            0x1
#define _NCO2INCH_NCO2INC14_LENGTH                          0x1
#define _NCO2INCH_NCO2INC14_MASK                            0x40
#define _NCO2INCH_NCO2INC15_POSN                            0x7
#define _NCO2INCH_NCO2INC15_POSITION                        0x7
#define _NCO2INCH_NCO2INC15_SIZE                            0x1
#define _NCO2INCH_NCO2INC15_LENGTH                          0x1
#define _NCO2INCH_NCO2INC15_MASK                            0x80
#define _NCO2INCH_INC8_POSN                                 0x0
#define _NCO2INCH_INC8_POSITION                             0x0
#define _NCO2INCH_INC8_SIZE                                 0x1
#define _NCO2INCH_INC8_LENGTH                               0x1
#define _NCO2INCH_INC8_MASK                                 0x1
#define _NCO2INCH_INC9_POSN                                 0x1
#define _NCO2INCH_INC9_POSITION                             0x1
#define _NCO2INCH_INC9_SIZE                                 0x1
#define _NCO2INCH_INC9_LENGTH                               0x1
#define _NCO2INCH_INC9_MASK                                 0x2
#define _NCO2INCH_INC10_POSN                                0x2
#define _NCO2INCH_INC10_POSITION                            0x2
#define _NCO2INCH_INC10_SIZE                                0x1
#define _NCO2INCH_INC10_LENGTH                              0x1
#define _NCO2INCH_INC10_MASK                                0x4
#define _NCO2INCH_INC11_POSN                                0x3
#define _NCO2INCH_INC11_POSITION                            0x3
#define _NCO2INCH_INC11_SIZE                                0x1
#define _NCO2INCH_INC11_LENGTH                              0x1
#define _NCO2INCH_INC11_MASK                                0x8
#define _NCO2INCH_INC12_POSN                                0x4
#define _NCO2INCH_INC12_POSITION                            0x4
#define _NCO2INCH_INC12_SIZE                                0x1
#define _NCO2INCH_INC12_LENGTH                              0x1
#define _NCO2INCH_INC12_MASK                                0x10
#define _NCO2INCH_INC13_POSN                                0x5
#define _NCO2INCH_INC13_POSITION                            0x5
#define _NCO2INCH_INC13_SIZE                                0x1
#define _NCO2INCH_INC13_LENGTH                              0x1
#define _NCO2INCH_INC13_MASK                                0x20
#define _NCO2INCH_INC14_POSN                                0x6
#define _NCO2INCH_INC14_POSITION                            0x6
#define _NCO2INCH_INC14_SIZE                                0x1
#define _NCO2INCH_INC14_LENGTH                              0x1
#define _NCO2INCH_INC14_MASK                                0x40
#define _NCO2INCH_INC15_POSN                                0x7
#define _NCO2INCH_INC15_POSITION                            0x7
#define _NCO2INCH_INC15_SIZE                                0x1
#define _NCO2INCH_INC15_LENGTH                              0x1
#define _NCO2INCH_INC15_MASK                                0x80
#define _NCO2INCH_NCO2INC_POSN                              0x0
#define _NCO2INCH_NCO2INC_POSITION                          0x0
#define _NCO2INCH_NCO2INC_SIZE                              0x8
#define _NCO2INCH_NCO2INC_LENGTH                            0x8
#define _NCO2INCH_NCO2INC_MASK                              0xFF

