GopalSaraf/Practicals/PSDL/include/proc/pic18f56q43.h
extern volatile PWM1PRHbits_t PWM1PRHbits __at(0x464);
// bitfield macros
#define _PWM1PRH_PRH_POSN                                   0x0
#define _PWM1PRH_PRH_POSITION                               0x0
#define _PWM1PRH_PRH_SIZE                                   0x8
#define _PWM1PRH_PRH_LENGTH                                 0x8
#define _PWM1PRH_PRH_MASK                                   0xFF

// Register: PWM1CPRE
#define PWM1CPRE PWM1CPRE
extern volatile unsigned char           PWM1CPRE            __at(0x465);
#ifndef _LIB_BUILD
asm("PWM1CPRE equ 0465h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRE                   :8;
    };
} PWM1CPREbits_t;
extern volatile PWM1CPREbits_t PWM1CPREbits __at(0x465);
// bitfield macros
#define _PWM1CPRE_CPRE_POSN                                 0x0
#define _PWM1CPRE_CPRE_POSITION                             0x0
#define _PWM1CPRE_CPRE_SIZE                                 0x8
#define _PWM1CPRE_CPRE_LENGTH                               0x8
#define _PWM1CPRE_CPRE_MASK                                 0xFF

// Register: PWM1PIPOS
#define PWM1PIPOS PWM1PIPOS
extern volatile unsigned char           PWM1PIPOS           __at(0x466);
#ifndef _LIB_BUILD
asm("PWM1PIPOS equ 0466h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIPOS                  :8;
    };
} PWM1PIPOSbits_t;
extern volatile PWM1PIPOSbits_t PWM1PIPOSbits __at(0x466);
// bitfield macros
#define _PWM1PIPOS_PIPOS_POSN                               0x0
#define _PWM1PIPOS_PIPOS_POSITION                           0x0
#define _PWM1PIPOS_PIPOS_SIZE                               0x8
#define _PWM1PIPOS_PIPOS_LENGTH                             0x8
#define _PWM1PIPOS_PIPOS_MASK                               0xFF

// Register: PWM1GIR
#define PWM1GIR PWM1GIR
extern volatile unsigned char           PWM1GIR             __at(0x467);
#ifndef _LIB_BUILD
asm("PWM1GIR equ 0467h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1IF                 :1;
        unsigned S1P2IF                 :1;
    };
} PWM1GIRbits_t;
extern volatile PWM1GIRbits_t PWM1GIRbits __at(0x467);
// bitfield macros
#define _PWM1GIR_S1P1IF_POSN                                0x0
#define _PWM1GIR_S1P1IF_POSITION                            0x0
#define _PWM1GIR_S1P1IF_SIZE                                0x1
#define _PWM1GIR_S1P1IF_LENGTH                              0x1
#define _PWM1GIR_S1P1IF_MASK                                0x1
#define _PWM1GIR_S1P2IF_POSN                                0x1
#define _PWM1GIR_S1P2IF_POSITION                            0x1
#define _PWM1GIR_S1P2IF_SIZE                                0x1
#define _PWM1GIR_S1P2IF_LENGTH                              0x1
#define _PWM1GIR_S1P2IF_MASK                                0x2

// Register: PWM1GIE
#define PWM1GIE PWM1GIE
extern volatile unsigned char           PWM1GIE             __at(0x468);
#ifndef _LIB_BUILD
asm("PWM1GIE equ 0468h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1IE                 :1;
        unsigned S1P2IE                 :1;
    };
} PWM1GIEbits_t;
extern volatile PWM1GIEbits_t PWM1GIEbits __at(0x468);
// bitfield macros
#define _PWM1GIE_S1P1IE_POSN                                0x0
#define _PWM1GIE_S1P1IE_POSITION                            0x0
#define _PWM1GIE_S1P1IE_SIZE                                0x1
#define _PWM1GIE_S1P1IE_LENGTH                              0x1
#define _PWM1GIE_S1P1IE_MASK                                0x1
#define _PWM1GIE_S1P2IE_POSN                                0x1
#define _PWM1GIE_S1P2IE_POSITION                            0x1
#define _PWM1GIE_S1P2IE_SIZE                                0x1
#define _PWM1GIE_S1P2IE_LENGTH                              0x1
#define _PWM1GIE_S1P2IE_MASK                                0x2

// Register: PWM1CON
#define PWM1CON PWM1CON
extern volatile unsigned char           PWM1CON             __at(0x469);
#ifndef _LIB_BUILD
asm("PWM1CON equ 0469h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERSNOW                 :1;
        unsigned ERSPOL                 :1;
        unsigned LD                     :1;
        unsigned                        :4;
        unsigned EN                     :1;
    };
} PWM1CONbits_t;
extern volatile PWM1CONbits_t PWM1CONbits __at(0x469);
// bitfield macros
#define _PWM1CON_ERSNOW_POSN                                0x0
#define _PWM1CON_ERSNOW_POSITION                            0x0
#define _PWM1CON_ERSNOW_SIZE                                0x1
#define _PWM1CON_ERSNOW_LENGTH                              0x1
#define _PWM1CON_ERSNOW_MASK                                0x1
#define _PWM1CON_ERSPOL_POSN                                0x1
#define _PWM1CON_ERSPOL_POSITION                            0x1
#define _PWM1CON_ERSPOL_SIZE                                0x1
#define _PWM1CON_ERSPOL_LENGTH                              0x1
#define _PWM1CON_ERSPOL_MASK                                0x2
#define _PWM1CON_LD_POSN                                    0x2
#define _PWM1CON_LD_POSITION                                0x2
#define _PWM1CON_LD_SIZE                                    0x1
#define _PWM1CON_LD_LENGTH                                  0x1
#define _PWM1CON_LD_MASK                                    0x4
#define _PWM1CON_EN_POSN                                    0x7
#define _PWM1CON_EN_POSITION                                0x7
#define _PWM1CON_EN_SIZE                                    0x1
#define _PWM1CON_EN_LENGTH                                  0x1
#define _PWM1CON_EN_MASK                                    0x80

// Register: PWM1S1CFG
#define PWM1S1CFG PWM1S1CFG
extern volatile unsigned char           PWM1S1CFG           __at(0x46A);
#ifndef _LIB_BUILD
asm("PWM1S1CFG equ 046Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned PPEN                   :1;
        unsigned                        :2;
        unsigned POL1                   :1;
        unsigned POL2                   :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
} PWM1S1CFGbits_t;
extern volatile PWM1S1CFGbits_t PWM1S1CFGbits __at(0x46A);
// bitfield macros
#define _PWM1S1CFG_MODE_POSN                                0x0
#define _PWM1S1CFG_MODE_POSITION                            0x0
#define _PWM1S1CFG_MODE_SIZE                                0x3
#define _PWM1S1CFG_MODE_LENGTH                              0x3
#define _PWM1S1CFG_MODE_MASK                                0x7
#define _PWM1S1CFG_PPEN_POSN                                0x3
#define _PWM1S1CFG_PPEN_POSITION                            0x3
#define _PWM1S1CFG_PPEN_SIZE                                0x1
#define _PWM1S1CFG_PPEN_LENGTH                              0x1
#define _PWM1S1CFG_PPEN_MASK                                0x8
#define _PWM1S1CFG_POL1_POSN                                0x6
#define _PWM1S1CFG_POL1_POSITION                            0x6
#define _PWM1S1CFG_POL1_SIZE                                0x1
#define _PWM1S1CFG_POL1_LENGTH                              0x1
#define _PWM1S1CFG_POL1_MASK                                0x40
#define _PWM1S1CFG_POL2_POSN                                0x7
#define _PWM1S1CFG_POL2_POSITION                            0x7
#define _PWM1S1CFG_POL2_SIZE                                0x1
#define _PWM1S1CFG_POL2_LENGTH                              0x1
#define _PWM1S1CFG_POL2_MASK                                0x80
#define _PWM1S1CFG_MODE0_POSN                               0x0
#define _PWM1S1CFG_MODE0_POSITION                           0x0
#define _PWM1S1CFG_MODE0_SIZE                               0x1
#define _PWM1S1CFG_MODE0_LENGTH                             0x1
#define _PWM1S1CFG_MODE0_MASK                               0x1
#define _PWM1S1CFG_MODE1_POSN                               0x1
#define _PWM1S1CFG_MODE1_POSITION                           0x1
#define _PWM1S1CFG_MODE1_SIZE                               0x1
#define _PWM1S1CFG_MODE1_LENGTH                             0x1
#define _PWM1S1CFG_MODE1_MASK                               0x2
#define _PWM1S1CFG_MODE2_POSN                               0x2
#define _PWM1S1CFG_MODE2_POSITION                           0x2
#define _PWM1S1CFG_MODE2_SIZE                               0x1
#define _PWM1S1CFG_MODE2_LENGTH                             0x1
#define _PWM1S1CFG_MODE2_MASK                               0x4

// Register: PWM1S1P1
#define PWM1S1P1 PWM1S1P1
extern volatile unsigned short          PWM1S1P1            __at(0x46B);
#ifndef _LIB_BUILD
asm("PWM1S1P1 equ 046Bh");
#endif

// Register: PWM1S1P1L
#define PWM1S1P1L PWM1S1P1L
extern volatile unsigned char           PWM1S1P1L           __at(0x46B);
#ifndef _LIB_BUILD
asm("PWM1S1P1L equ 046Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1L                  :8;
    };
} PWM1S1P1Lbits_t;
extern volatile PWM1S1P1Lbits_t PWM1S1P1Lbits __at(0x46B);
// bitfield macros
#define _PWM1S1P1L_S1P1L_POSN                               0x0
#define _PWM1S1P1L_S1P1L_POSITION                           0x0
#define _PWM1S1P1L_S1P1L_SIZE                               0x8
#define _PWM1S1P1L_S1P1L_LENGTH                             0x8
#define _PWM1S1P1L_S1P1L_MASK                               0xFF

